$(function() {
			var nav_top = $('#nav').css('top');
			$(window).scroll(function() {
				if($(window).scrollTop() >= 200) {
					$('#nav').css('top', '0');
				} else {
					$('#nav').css('top', parseInt(nav_top) - $(window).scrollTop() + 'px');
				}
			});
			$("#daogou .lunbotu .box>ul>img").attr('src','../img/adidas506399348.jpg');
	    	    var arr1=[{
	    	    	maintitle:'配饰',
	    	    	type_title:[
	    	    	{title:'饰品',
	    	    	value:['项链','项坠/吊坠','手链/手镯','戒指/指环','脚链','发饰','装饰/配件','胸针/胸花','耳饰']},
	    	    	{title:'手表/眼镜',
	    	    	value:['手表','眼镜']},
	    	    	{title:'服装配饰',
	    	    	value:['手套','腰带','围巾','帽子']},
	    	    	{title:'珠宝',
	    	    	value:['手链/手镯','戒指/指环','项链','首饰套装','项坠/吊坠']}]
	    	    },
	    	    {
	    	    	maintitle:'男鞋',
	    	    	type_title:[{title:'男士单鞋',
	    	    	value:['正装鞋','布鲁彻尔鞋','工装鞋','休闲鞋','帆船鞋','豆豆鞋','打孔鞋','运动休闲','布洛克鞋','帆布鞋','内增高','德比鞋','懒人鞋','棉拖','商务鞋','满帮鞋','系带鞋','牛津鞋','乐福鞋']},
	    	    	{title:'鞋护理品',
	    	    	value:['男鞋','配饰']},
	    	    	{title:'男士靴子',
	    	    	value:['雪地靴','中靴','低靴','雨靴','高靴']},
	    	    	{title:'男士凉鞋',
	    	    	value:['人字拖','拖鞋','纯凉鞋']}]
	    	    },
	    	    {
	    	    	maintitle:'内衣',
	    	    	type_title:[{title:'女士内衣',
	    	    	value:['吊带背心','基础打底','泳装','文胸','内裤','保暖内衣','家居服','袜子','塑身美体']},
	    	    	{title:'男士内衣',
	    	    	value:['家居服','内裤','保暖内衣','背心','袜子']}]
	    	    },
	    	    {
	    	    	maintitle:'女装',
	    	    	type_title:[{title:'女装上装',
	    	    	value:['卫衣/绒衫','衬衫','蕾丝衫/雪纺衫','针织衫','马甲','背心','大码女装','T恤','毛衣/羊绒衫']},
	    	    	{title:'女装外套',
	    	    	value:['毛呢外套','皮衣','大衣','短外套','套装','西装','风衣','羽绒服','棉服/棉衣']},
	    	    	{title:'女装裤装',
	    	    	value:['打底裤','牛仔裤','休闲裤','短裤']},
	    	    	{title:'女装裙装',
	    	    	value:['半身裙','连衣裙']}]
	    	    },
	    	    {
	    	    	maintitle:'女鞋',
	    	    	type_title:[{title:'女士靴子',
	    	    	value:['坡跟靴','长靴','雪地靴','及踝靴','绒里靴','超长靴','骑士靴','马丁靴','短靴','雨靴','中靴']},
	    	    	{title:'女士单鞋',
	    	    	value:['内增高','满帮鞋','运动风','鱼嘴鞋','婚鞋','浅口鞋','注塑鞋','乐福鞋','防水台','棉拖','平底鞋','帆布鞋','超高跟','坡跟鞋','粗跟鞋','松糕鞋','布洛克鞋','豆豆鞋','雨鞋','尖头鞋','休闲鞋']},
	    	    	{title:'女士凉鞋',
	    	    	value:['纯凉鞋','坡跟凉鞋','鱼嘴凉鞋','拖鞋','凉靴','后空凉鞋','中空凉鞋']}]
	    	    },
	    	    {
	    	    	maintitle:'男装',
	    	    	type_title:[{title:'男装外套',
	    	    	value:['套装','风衣','棉衣','西服','羽绒服','夹克','皮衣','毛呢大衣']},
	    	    	{title:'男装裤装',
	    	    	value:['休闲裤','短裤','牛仔裤','小脚裤','西裤']},
	    	    	{title:'男装上装',
	    	    	value:['针织衫/毛衣','POLO衫','背心/马甲','卫衣','衬衫','T恤']}]
	    	    },
	    	    {
	    	    	maintitle:'户外',
	    	    	type_title:[{title:'户外鞋靴',
	    	    	value:['工装靴','营地鞋','凉拖鞋','越野鞋','登山鞋','溯溪鞋','休闲鞋','沙滩鞋','徒步鞋']},
	    	    	{title:'户外装备',
	    	    	value:['露营装备','防潮垫','睡袋','手套/袜子','帽子/头巾/眼镜','水具','登山杖','帐篷']},
	    	    	{title:'户外服装',
	    	    	value:['休闲裤','冲锋裤','抓绒衣裤','短裤','骑行衣裤','速干衣裤','棉服','冲锋衣','T恤','软壳衬衫','羽绒服','皮肤衣','POLO衫','卫衣']},
	    	    	{title:'户外包装',
	    	    	value:['其它包','登山包','摄影包','腰包/挎包','双肩包','卡包/钱包','日常背包','单肩包']}]
	    	    },
	    	    {
	    	    	maintitle:'家居用品',
	    	    	type_title:[{title:'床上用品',
	    	    	value:['被套','被子','床单','枕头','凉席','枕套','休闲毯','蚊帐','床垫','床品套件']},
	    	    	{title:'家居百货',
	    	    	value:['伞','毛巾/浴巾/浴袍','保温杯/桶','修甲','美容工具','坐垫/靠垫','收纳箱','厨房用品']}]
	    	    },
	    	    {
	    	    	maintitle:'箱包',
	    	    	type_title:[{title:'男包',
	    	    	value:['胸包','手提包/手包','双肩包','钱包','单肩包/斜挎包','腰包/挎包']},
	    	    	{title:'功能包',
	    	    	value:['电脑包','钥匙包','公文包','卡包']},
	    	    	{title:'旅行箱包',
	    	    	value:['旅行箱','旅行袋']},
	    	    	{title:'女包',
	    	    	value:['手提包/手包','单肩包/斜挎包','钱包','双肩包']},
	    	    	{title:'包配',
	    	    	value:['箱包','配件']}]
	    	    },
	    	    {
	    	    	maintitle:'孕婴童',
	    	    	type_title:[{title:'玩具/运动器具',
	    	    	value:['运动护具','球类','泳具']},
	    	    	{title:'母婴用品',
	    	    	value:['抱被/斗篷','睡衣/睡袋','妈妈用品','床品','连体衣','婴儿外出服']},
	    	    	{title:'儿童配件',
	    	    	value:['帽子','手套','袜子','装备包','围巾']},
	    	    	{title:'童装',
	    	    	value:['POLO衫','T恤','衬衣','外套/风衣','棉服/羽绒服','毛衣/针织衫','裙装','卫衣','儿童套服','裤装','吊带/背心']},
	    	    	{title:'童鞋',
	    	    	value:['足球鞋','复刻鞋','凉拖鞋','训练鞋','布鞋','休闲鞋','跑步鞋','学步鞋/步前鞋','篮球鞋','板鞋','网眼鞋','皮鞋','户外鞋','童靴']}]
	    	    },
	    	    {
	    	    	maintitle:'运动',
	    	    	type_title:[{title:'运动项目',
	    	    	value:['羽毛球','赛车','篮球','游泳','足球','综合训练','网球','户外滑板','跑步']},
	    	    	{title:'运动鞋/休闲鞋',
	    	    	value:['休闲鞋','户外鞋','帆布鞋','网球鞋','赛车鞋','足球鞋','羽毛球鞋','乒乓球鞋','篮球鞋','室内鞋','经典复刻鞋','复古鞋','综合训练鞋','板鞋','凉鞋/拖鞋','跑步鞋']},
	    	    	{title:'运动包',
	    	    	value:['斜挎包','桶包','钱包','腰包','双肩包','手提包','单肩包']},
	    	    	{title:'运动服',
	    	    	value:['衬衫','夹克','T恤','套服','马甲','牛仔裤','毛衣','中裤','长裤','紧身衣/胸衣','裙子','背心','POLO衫','泳装','羽绒服','棉服','卫衣/套头衫','短裤']},
	    	    	{title:'运动装备',
	    	    	value:['装备','泳具','围巾','水壶','帽子','足球','潮流配件','篮球','防滑手胶','手套','袜子','护具','运动器材']}]
	    	    },
	    	    {
	    	    	maintitle:'化妆品',
	    	    	type_title:[{title:'护肤',
	    	    	value:['面部保养','身体保养','眼部护理','面膜','面贴','面部清洁']},
	    	    	{title:'彩妆',
	    	    	value:['腮红','睫毛膏','眼线笔','遮瑕','眉笔/眉粉','CC霜','BB霜','气垫','粉饼','唇膏/口红','卸妆液/卸妆油/卸妆膏','眼影']}]
	    	    },
	    	    {
	    	    	maintitle:'运动户外',
	    	    	type_title:[{title:'运动',
	    	    	value:['羽绒服','毛衣','泳装','卫衣/套头衫','背心','POLO衫','套服','棉服','衬衫','紧身服/胸衣','长袖','T恤','夹克','马夹','短袖','T恤','针织衫','短裤','中裤','裙子','牛仔裤','长裤','球拍','防滑手胶','护具装备','袜子','足球','手套','排球','乒乓球','围巾','泳具','网球','帽子','运动器材','潮流配件','羽毛球','水壶','篮球','综合训练','羽毛球','足球','滑板','游泳','户外篮球','赛车','网球','跑步','桶包','单肩包','腰包','手提包','钱包','双肩包','斜挎包','凉鞋/拖鞋','休闲鞋','经典复刻鞋','板鞋','帆布鞋','复古鞋','足球鞋','羽毛球鞋','网球鞋','综合训练鞋','篮球鞋','跑步鞋','室内鞋','户外鞋','乒乓球鞋','赛车鞋']},
	    	    	{title:'户外',
	    	    	value:['卫衣裙','装速干衣','骑行服','T恤','毛衫','运动文胸','衬衫','POLO衫','抓绒衣','羽绒服','马甲','保暖休闲衣','冲锋衣','软壳棉服','皮肤衣','短裤','休闲裤','冲锋裤','抓绒裤','速干裤','骑行裤','头巾','眼镜','袜子','手套','手表','帽子','休闲鞋','登山鞋','凉拖鞋','营地鞋','溯溪鞋','徒步鞋','越野鞋','电脑包','摄影包','卡包/钱包','攀岩包','骑行包','手臂包','越野包','日常背包','钓鱼包','徒步包','生存包','防水包','腰包/挂包','挎包','登山包','洗漱包','工具刀铲','睡袋','帐篷','望远镜','防潮垫','炉具','餐具','健身器材','拍类灯具','床/椅','枕头/垫子','水具球类','登山杖','钓竿','渔具包']}]
	    	    }];
	    	    for(let i=0;i<arr1.length;i++){
	    	    $('#body').append('<div class="content"></div>');
//	    	    console.log(arr1[i].type_title[1].value);
	    	    }
	    	    $('#body .content').each(function(i){
	    	    	$(this).append('<div class="body_top"><b></b><i>'+arr1[i].maintitle+'</i></div>');
	    	        $(this).append('<div class="body_bot"></div>');
	    	        for(let j=0;j<arr1[i].type_title.length;j++){
	    	        $(this).children('.body_bot').append('<ul><a href="">'+arr1[i].type_title[j].title+'</a><li></li></ul>');
	    	             for(let k=0;k<arr1[i].type_title[j].value.length;k++){
//	    	             	console.log(arr1[i].type_title[j].value[k]);
//	    	             	console.log($(this).children('.body_bot').children('ul').children('li'));
	    	             $(this).children('.body_bot').children('ul').children('li').append('<a href="">'+arr1[i].type_title[j].value[k]+'</a>');
	    	             }
	    	        }
	    	        
	    	    });
	    	})